; domain
;Header and description

(define (domain blocks)

;remove requirements that are not needed
(:requirements :strips :typing :conditional-effects :equality :universal-preconditions :negative-preconditions)

(:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
    physob
)

; un-comment following line if constants are needed
;(:constants )

(:predicates ;todo: define predicates here
    (ontable ?x - physob)
    (clear ?x - physob)
    (on ?x ?y - physob)
)


; (:functions ;todo: define numeric functions here
; )

;define actions here
(:action move
    :parameters (?x ?y - physob)
    :precondition (and (clear ?x) (clear ?y) )
    :effect (and (on ?x ?y) (not (clear ?y))
        (when (ontable ?x) (not (ontable ?x)))
        (forall (?z - physob) (when (on ?x ?z) (and (not (on ?x ?z)) (clear ?z))))
    )
)

(:action moveToTable
    :parameters (?x - physob)
    :precondition (and (clear ?x) (not (ontable ?x)))
    :effect (and (not (clear ?x)) (ontable ?x)
        (forall (?z - physob) (when (on ?x ?z) (and (not (on ?x ?z)) (clear ?z))))
    )
)


)

; problem
(define (problem prob) (:domain blocks)
(:objects 
    A B C D E F - physob
)

(:init
    ;todo: put the initial state's facts and numeric values here
    (clear A) (on A B) (on B C) (ontable C) (ontable D)
    (ontable F) (on E D) (clear E) (clear F)
)

(:goal (and
    ;todo: put the goal condition here
    (clear F) (on F A) (on A C) (ontable C) (clear E)
    (on E B) (on B D) (ontable D)
))

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (move a f)
   deleted: (clear f) (on a b)
   added: (on a f) (clear b)
   goals met: 3 of 8
2. (move b e)
   deleted: (clear e) (on b c)
   added: (on b e) (clear c)
   goals met: 2 of 8
3. (move a c)
   deleted: (clear c) (on a f)
   added: (on a c) (clear f)
   goals met: 4 of 8
4. (move b a)
   deleted: (clear a) (on b e)
   added: (on b a) (clear e)
   goals met: 5 of 8
5. (move e f)
   deleted: (clear f) (on e d)
   added: (on e f) (clear d)
   goals met: 4 of 8
6. (move b d)
   deleted: (clear d) (on b a)
   added: (on b d) (clear a)
   goals met: 5 of 8
7. (move e b)
   deleted: (clear b) (on e f)
   added: (on e b) (clear f)
   goals met: 7 of 8
8. (move f a)
   deleted: (clear a) (ontable f)
   added: (on f a)
   goals met: 8 of 8
